<a href="https://colab.research.google.com/github/jrivest2/DS-Unit-2-Linear-Models/blob/master/module3-ridge-regression/Justin_Rivest_LS_DS_213_assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 2, Sprint 1, Module 3*

---

# Ridge Regression

## Assignment

We're going back to our other **New York City** real estate dataset. Instead of predicting apartment rents, you'll predict property sales prices.

But not just for condos in Tribeca...

- [ ] Use a subset of the data where `BUILDING_CLASS_CATEGORY` == `'01 ONE FAMILY DWELLINGS'` and the sale price was more than 100 thousand and less than 2 million.
- [ ] Do train/test split. Use data from January â€”Â March 2019 to train. Use data from April 2019 to test.
- [ ] Do one-hot encoding of categorical features.
- [ ] Do feature selection with `SelectKBest`.
- [ ] Fit a ridge regression model with multiple features. Use the `normalize=True` parameter (or do [feature scaling](https://scikit-learn.org/stable/modules/preprocessing.html) beforehand â€”Â use the scaler's `fit_transform` method with the train set, and the scaler's `transform` method with the test set)
- [ ] Get mean absolute error for the test set.
- [ ] As always, commit your notebook to your fork of the GitHub repo.

The [NYC Department of Finance](https://www1.nyc.gov/site/finance/taxes/property-rolling-sales-data.page) has a glossary of property sales terms and NYC Building Class Code Descriptions. The data comes from the [NYC OpenData](https://data.cityofnewyork.us/browse?q=NYC%20calendar%20sales) portal.


## Stretch Goals

Don't worry, you aren't expected to do all these stretch goals! These are just ideas to consider and choose from.

- [ ] Add your own stretch goal(s) !
- [ ] Instead of `Ridge`, try `LinearRegression`. Depending on how many features you select, your errors will probably blow up! ðŸ’¥
- [ ] Instead of `Ridge`, try [`RidgeCV`](https://scikit-learn.org/stable/modules/generated/sklearn.linear_model.RidgeCV.html).
- [ ] Learn more about feature selection:
    - ["Permutation importance"](https://www.kaggle.com/dansbecker/permutation-importance)
    - [scikit-learn's User Guide for Feature Selection](https://scikit-learn.org/stable/modules/feature_selection.html)
    - [mlxtend](http://rasbt.github.io/mlxtend/) library
    - scikit-learn-contrib libraries: [boruta_py](https://github.com/scikit-learn-contrib/boruta_py) & [stability-selection](https://github.com/scikit-learn-contrib/stability-selection)
    - [_Feature Engineering and Selection_](http://www.feat.engineering/) by Kuhn & Johnson.
- [ ] Try [statsmodels](https://www.statsmodels.org/stable/index.html) if youâ€™re interested in more inferential statistical approach to linear regression and feature selection, looking at p values and 95% confidence intervals for the coefficients.
- [ ] Read [_An Introduction to Statistical Learning_](http://faculty.marshall.usc.edu/gareth-james/ISL/ISLR%20Seventh%20Printing.pdf), Chapters 1-3, for more math & theory, but in an accessible, readable way.
- [ ] Try [scikit-learn pipelines](https://scikit-learn.org/stable/modules/compose.html).

In [67]:
%%capture
import sys

# If you're on Colab:
if 'google.colab' in sys.modules:
    DATA_PATH = 'https://raw.githubusercontent.com/LambdaSchool/DS-Unit-2-Applied-Modeling/master/data/'
    !pip install category_encoders==2.*

# If you're working locally:
else:
    DATA_PATH = '../data/'
    
# Ignore this Numpy warning when using Plotly Express:
# FutureWarning: Method .ptp is deprecated and will be removed in a future version. Use numpy.ptp instead.
import warnings
warnings.filterwarnings(action='ignore', category=FutureWarning, module='numpy')

In [68]:
import pandas as pd
import pandas_profiling

# Read New York City property sales data
df = pd.read_csv(DATA_PATH+'condos/NYC_Citywide_Rolling_Calendar_Sales.csv')

# Change column names: replace spaces with underscores
df.columns = [col.replace(' ', '_') for col in df]

# SALE_PRICE was read as strings.
# Remove symbols, convert to integer
df['SALE_PRICE'] = (
    df['SALE_PRICE']
    .str.replace('$','')
    .str.replace('-','')
    .str.replace(',','')
    .astype(int)
)

In [69]:
# BOROUGH is a numeric column, but arguably should be a categorical feature,
# so convert it from a number to a string
df['BOROUGH'] = df['BOROUGH'].astype(str)

In [70]:
# Reduce cardinality for NEIGHBORHOOD feature

# Get a list of the top 10 neighborhoods
top10 = df['NEIGHBORHOOD'].value_counts()[:10].index

# At locations where the neighborhood is NOT in the top 10, 
# replace the neighborhood with 'OTHER'
df.loc[~df['NEIGHBORHOOD'].isin(top10), 'NEIGHBORHOOD'] = 'OTHER'

# EDA

In [71]:
df

      BOROUGH             NEIGHBORHOOD  ... SALE_PRICE   SALE_DATE
0           1                    OTHER  ...          0  01/01/2019
1           1                    OTHER  ...          0  01/01/2019
2           1                    OTHER  ...          0  01/01/2019
3           1                    OTHER  ...          0  01/01/2019
4           1  UPPER EAST SIDE (59-79)  ...          0  01/01/2019
...       ...                      ...  ...        ...         ...
23035       4                    OTHER  ...     510000  04/30/2019
23036       4                    OTHER  ...     355000  04/30/2019
23037       4                    OTHER  ...     375000  04/30/2019
23038       4                    OTHER  ...    1100000  04/30/2019
23039       4                    OTHER  ...     569202  04/30/2019

[23040 rows x 21 columns]

### Use a subset of the data where BUILDING_CLASS_CATEGORY == '01 ONE FAMILY DWELLINGS' and the sale price was more than 100 thousand and less than 2 million.

In [72]:
df = df[df['BUILDING_CLASS_CATEGORY'] == '01 ONE FAMILY DWELLINGS']
df = df[df['SALE_PRICE'] < 2000000]
df = df[df['SALE_PRICE'] > 100000]

In [73]:
df.head()

    BOROUGH NEIGHBORHOOD  ... SALE_PRICE   SALE_DATE
44        3        OTHER  ...     550000  01/01/2019
61        4        OTHER  ...     200000  01/01/2019
78        2        OTHER  ...     810000  01/02/2019
108       3        OTHER  ...     125000  01/02/2019
111       3        OTHER  ...     620000  01/02/2019

[5 rows x 21 columns]

In [74]:
df

      BOROUGH NEIGHBORHOOD  ... SALE_PRICE   SALE_DATE
44          3        OTHER  ...     550000  01/01/2019
61          4        OTHER  ...     200000  01/01/2019
78          2        OTHER  ...     810000  01/02/2019
108         3        OTHER  ...     125000  01/02/2019
111         3        OTHER  ...     620000  01/02/2019
...       ...          ...  ...        ...         ...
23029       4        OTHER  ...     635000  04/30/2019
23031       4        OTHER  ...     514000  04/30/2019
23032       4        OTHER  ...     635000  04/30/2019
23033       4        OTHER  ...     545000  04/30/2019
23035       4        OTHER  ...     510000  04/30/2019

[3151 rows x 21 columns]

In [75]:
df.describe()

              BLOCK          LOT  ...  TAX_CLASS_AT_TIME_OF_SALE    SALE_PRICE
count   3151.000000  3151.000000  ...                     3151.0  3.151000e+03
mean    6917.976515    75.981593  ...                        1.0  6.285601e+05
std     3963.326705   161.089514  ...                        0.0  2.929904e+05
min       21.000000     1.000000  ...                        1.0  1.040000e+05
25%     4016.000000    21.000000  ...                        1.0  4.475000e+05
50%     6301.000000    42.000000  ...                        1.0  5.680000e+05
75%    10208.500000    69.000000  ...                        1.0  7.600000e+05
max    16350.000000  2720.000000  ...                        1.0  1.955000e+06

[8 rows x 11 columns]

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3151 entries, 44 to 23035
Data columns (total 21 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   BOROUGH                         3151 non-null   object
 1   NEIGHBORHOOD                    3151 non-null   object
 2   BUILDING_CLASS_CATEGORY         3151 non-null   object
 3   TAX_CLASS_AT_PRESENT            3151 non-null   object
 4   BLOCK                           3151 non-null   int64
 5   LOT                             3151 non-null   int64
 6   EASE-MENT                       0 non-null      float64
 7   BUILDING_CLASS_AT_PRESENT       3151 non-null   object
 8   ADDRESS                         3151 non-null   object
 9   APARTMENT_NUMBER                1 non-null      object
 10  ZIP_CODE                        3151 non-null   float64
 11  RESIDENTIAL_UNITS               3151 non-null   float64
 12  COMMERCIAL_UNITS                3151 non-null   float64
 13  TOTAL_UNITS                     3151 non-null   float64
 14  LAND_SQUARE_FEET                3151 non-null   object
 15  GROSS_SQUARE_FEET               3151 non-null   float64
 16  YEAR_BUILT                      3151 non-null   float64
 17  TAX_CLASS_AT_TIME_OF_SALE       3151 non-null   int64
 18  BUILDING_CLASS_AT_TIME_OF_SALE  3151 non-null   object
 19  SALE_PRICE                      3151 non-null   int64
 20  SALE_DATE                       3151 non-null   object
dtypes: float64(7), int64(4), object(10)
memory usage: 541.6+ KB

In [77]:
df.select_dtypes('object').nunique()

BOROUGH                              5
NEIGHBORHOOD                         6
BUILDING_CLASS_CATEGORY              1
TAX_CLASS_AT_PRESENT                 2
BUILDING_CLASS_AT_PRESENT           13
ADDRESS                           3135
APARTMENT_NUMBER                     1
LAND_SQUARE_FEET                  1035
BUILDING_CLASS_AT_TIME_OF_SALE      11
SALE_DATE                           91
dtype: int64

In [78]:
df['BUILDING_CLASS_CATEGORY'].value_counts()

01 ONE FAMILY DWELLINGS    3151
Name: BUILDING_CLASS_CATEGORY, dtype: int64

In [79]:
df['LAND_SQUARE_FEET'] = (
    df['LAND_SQUARE_FEET']
    .str.replace(',','')
    .astype(int)
)

In [80]:
df['LAND_SQUARE_FEET'].dtypes

dtype('int64')

In [81]:
df = df.drop(columns=['BUILDING_CLASS_CATEGORY','APARTMENT_NUMBER','EASE-MENT','ADDRESS','ZIP_CODE'])

In [82]:
df

      BOROUGH NEIGHBORHOOD  ... SALE_PRICE   SALE_DATE
44          3        OTHER  ...     550000  01/01/2019
61          4        OTHER  ...     200000  01/01/2019
78          2        OTHER  ...     810000  01/02/2019
108         3        OTHER  ...     125000  01/02/2019
111         3        OTHER  ...     620000  01/02/2019
...       ...          ...  ...        ...         ...
23029       4        OTHER  ...     635000  04/30/2019
23031       4        OTHER  ...     514000  04/30/2019
23032       4        OTHER  ...     635000  04/30/2019
23033       4        OTHER  ...     545000  04/30/2019
23035       4        OTHER  ...     510000  04/30/2019

[3151 rows x 16 columns]

In [83]:
df['SALE_DATE'].dtypes

dtype('O')

In [84]:
df['SALE_DATE'] = pd.to_datetime(df['SALE_DATE'])

df['SALE_MONTH'] = df['SALE_DATE'].dt.month

In [85]:
df.head()

    BOROUGH NEIGHBORHOOD  ...  SALE_DATE  SALE_MONTH
44        3        OTHER  ... 2019-01-01           1
61        4        OTHER  ... 2019-01-01           1
78        2        OTHER  ... 2019-01-02           1
108       3        OTHER  ... 2019-01-02           1
111       3        OTHER  ... 2019-01-02           1

[5 rows x 17 columns]

In [86]:
df = df.drop(columns='SALE_DATE')
df

      BOROUGH NEIGHBORHOOD  ... SALE_PRICE  SALE_MONTH
44          3        OTHER  ...     550000           1
61          4        OTHER  ...     200000           1
78          2        OTHER  ...     810000           1
108         3        OTHER  ...     125000           1
111         3        OTHER  ...     620000           1
...       ...          ...  ...        ...         ...
23029       4        OTHER  ...     635000           4
23031       4        OTHER  ...     514000           4
23032       4        OTHER  ...     635000           4
23033       4        OTHER  ...     545000           4
23035       4        OTHER  ...     510000           4

[3151 rows x 16 columns]

# Split Data

In [87]:
# Target Vector
y = df['SALE_PRICE']

# Feature Matrix
X = df.drop(columns='SALE_PRICE')

print(y.shape)
print(X.shape)

(3151,)
(3151, 15)

### Do train/test split. Use data from January â€” March 2019 to train. Use data from April 2019 to test.

In [88]:
# Train / Test Split

# Training Data
X_train = X[X['SALE_MONTH'] < 4]
y_train = df[df['SALE_MONTH'] < 4]['SALE_PRICE']

# Testing Data
X_test = X[X['SALE_MONTH'] == 4]
y_test = df[df['SALE_MONTH'] == 4]['SALE_PRICE']

# Alternative Way to do the test Train Split (Easier and quicker.)
# mask = df.SALE_MONTH == 4
# train = df.loc[~mask]
# test = df.loc[mask]

In [89]:
print(X_train.shape)
print(y_train.shape)
print(X_test.shape)
print(y_test.shape)
print(X.shape)
print(y.shape)

(2507, 15)
(2507,)
(644, 15)
(644,)
(3151, 15)
(3151,)

In [90]:
# Check that the test and train sets add up to the size of the whole.
len(X_test) + len(X_train) == len(X)

True

# Establish that Baseline

In [96]:
from sklearn.metrics import mean_absolute_error, mean_squared_error, r2_score

baseline_pred = [y_train.mean()] * len(y_train)

# Get that baseline MAE
baseline_mae = mean_absolute_error(y_train,baseline_pred)
baseline_rmse = mean_squared_error(y_train,baseline_pred)
baseline_r2score = r2_score(y_train,baseline_pred)

In [97]:
print("baseline MAE Score:", baseline_mae)
print("baseline RMSE Score:", baseline_rmse)
print("baseline R2 Score:", baseline_r2score) # The Baseline R2 score should always be 0

baseline MAE Score: 214721.52773001452
baseline RMSE Score: 85000855129.70863
baseline R2 Score: 0.0

###Do one-hot encoding of categorical features.

In [93]:
# Step 1: Import the transformer class
from category_encoders import OneHotEncoder

# Step 2: Instantiate the transformer
ohe = OneHotEncoder(use_cat_names=True)

# Step 3: Fit your TRAINING data to the transfomer
ohe.fit(X_train)

# Step 4: Transform
XT_train = ohe.transform(X_train)

/usr/local/lib/python3.6/dist-packages/category_encoders/utils.py:21: FutureWarning: is_categorical is deprecated and will be removed in a future version.  Use is_categorical_dtype instead
  elif pd.api.types.is_categorical(cols):

In [98]:
XT_train.shape

(2507, 47)

### Get a standard scaler

In [99]:
from sklearn.preprocessing import StandardScaler

ss = StandardScaler()
ss.fit(XT_train)
XTT_train = ss.transform(XT_train)

### Linear Regression

In [101]:
# Step 1
from sklearn.linear_model import LinearRegression

# Step 2
model = LinearRegression()

# Step 3
model.fit(XTT_train, y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [103]:
XT_test = ohe.transform(X_test)
XTT_test = ss.transform(XT_test)
test_pred = model.predict(XTT_test)

In [105]:


# Get that baseline MAE
test_mae = mean_absolute_error(y_test,test_pred)
test_rmse = mean_squared_error(y_test,test_pred)
test_r2score = r2_score(y_test,test_pred)

In [106]:
print("test MAE Score:", test_mae)
print("test RMSE Score:", test_rmse)
print("test R2 Score:", test_r2score)

test MAE Score: 3.5794160508613772e+16
test RMSE Score: 8.251069206692484e+35
test R2 Score: -9.36981147184065e+24